; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-41)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l5)
    (at p3 l3)
    (at p4 l1)
    (at p5 l7)
    (at p6 l8)
    (at p7 l2)
    (at v1 l4)
    (at v2 l5)
    (at v3 l9)
    (at v4 l3)
    (road l7 l4)
    (road l2 l4)
    (road l4 l9)
    (road l3 l7)
    (road l5 l4)
    (road l9 l6)
    (road l6 l1)
    (road l4 l2)
    (road l7 l3)
    (road l4 l5)
    (road l8 l9)
    (road l9 l8)
    (road l1 l6)
    (road l6 l9)
    (road l4 l7)
    (road l9 l4)
    (road l3 l6)
    (road l6 l3)
    (road l5 l9)
    (road l9 l5)
    (road l6 l7)
    (road l7 l6)
    (road l1 l4)
    (road l4 l1)
    (road l1 l9)
    (road l9 l1)
    (road l2 l3)
    (road l3 l2)
    (road l4 l6)
    (road l6 l4)
    (road l1 l8)
    (road l8 l1)
    (road l2 l7)
    (road l7 l2)
    (road l4 l8)
    (road l8 l4)
    (road l7 l8)
    (road l8 l7)
    (road l1 l7)
    (road l7 l1)
    (road l1 l5)
    (road l5 l1)
    (road l3 l8)
    (road l8 l3)
    (road l1 l3)
    (road l3 l1)
    (road l5 l6)
    (road l6 l5)
    (road l7 l9)
    (road l9 l7)
    )
 (:goal (and 
(at p3 l5)
))
)

; plan
1. (pick-up v4 l3 p3 c0 c1)
   deleted: (at p3 l3) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 0 of 1
2. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 0 of 1
3. (drive v4 l1 l5)
   deleted: (at v4 l1)
   added: (at v4 l5)
   goals met: 0 of 1
4. (drop v4 l5 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l5) (capacity v4 c1)
   goals met: 1 of 1
